<script lang="ts">
  import { typo, spaces } from "./styles";
  import WeekInfo from "./components/WeekInfo.svelte";
  import Footer from "./components/Footer.svelte";
  import DarkMode from "./components/DarkMode.svelte";
  import ShareButtons from "./components/ShareButtons.svelte";

  let titleIcon = process.env.NODE_ENV === "development" ? "🚧 " : "";
</script>

<svelte:head>
  <title>{titleIcon}Чет/нечет: Какая сейчас учебная неделя?</title>
</svelte:head>

<div
  class="box-content max-w-2xl children-max-w-xl mx-auto px-4 sm:px-8 py-6 sm:py-8 md:py-12 lg:py-20"
>
  <main class="">
    <DarkMode class="mb-4" />
    <h2 class={typo.overline}>Четная или нечетная</h2>
    <h1 class="{typo.h1} mb-4">Какая сейчас <br /> учебная неделя?</h1>

    <p class="text-lg">
      Во многих учебных заведениях занятия чередуются раз в 2 недели, для этого придумали чередовать
      учебные недели и называть их «четная» и «нечетная» соответственно.
    </p>

    <WeekInfo class={spaces.section} />

    <h2 class="{typo.h3} {spaces.headingSection}">Как определятся четность</h2>

    <p class="mb-3">
      Четность учебной недели считается особым образом. Общепринято считать, что первая учебная
      неделя в учебном году считается нечетной, далее они чередуются.
    </p>
    <p class="mb-3">
      К сожалению разные заведения по разному следуют этому правилу, например если первое сентября
      выпадает на воскресенье.
    </p>
    <p>
      Если четность на сайте не совпадает с четностью в вашем заведении, включите «альтернативный
      режим». Браузер запомнит ваш выбор и при следующем посещеннии, с того-же браузера, вам не
      нужно будет включать его еще раз.
    </p>
    <br />
  </main>

  <aside>
    <h2 class="{typo.overline} {spaces.section} mb-2">Поделиться</h2>
    <ShareButtons />
    <Footer class={spaces.section} />
  </aside>
</div>
